import Speciality from './index'
import async from 'async'

const data = ['Адміністратор баз даних', 'Архітектор програмного забезпечення', 'Менеджер з інформаційних технологій', 'Менеджер продуктів в області ІТ', 'Програміст', 'Керівник проектів в області ІТ', 'Керівник розробки програмного забезпечення', 'Системний аналітик', 'Фахівець з інформаційних ресурсів', 'Спеціаліст з інформаційних систем', 'Спеціаліст з тестування в області ІТ', 'Технічний письменник (фахівець з технічної документації в галузі ІТ)']

export default (cb) => Speciality.removeItem(null, () => {
  async.each(data, (name, callback) => {
    Speciality.addItem(name, (err, university) => {
      console.log(university)
      callback()
    })
  }, err => cb(err))
})


